templates/ws-scan_createscanjob.xml

<?xml version="1.0" encoding="ASCII"?>
<soap:Envelope
        xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
        xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
        xmlns:wscn="http://schemas.microsoft.com/windows/2006/01/wdp/scan">
    <soap:Header>
        <wsa:To>{{TO}}</wsa:To>
        <wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/scan/CreateScanJob</wsa:Action>
        <wsa:MessageID>urn:uuid:3b1adba5-d671-496b-8aac-b05d6471d056</wsa:MessageID>
        <wsa:From>
            <wsa:Address>{{FROM}}</wsa:Address>
        </wsa:From>
        <wsa:ReplyTo>
            <wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
        </wsa:ReplyTo>
    </soap:Header>
    <soap:Body>
        <wscn:CreateScanJobRequest>
            <wscn:ScanIdentifier>{{SCAN_ID}}</wscn:ScanIdentifier>
            <wscn:DestinationToken>{{DEST_TOKEN}}</wscn:DestinationToken>
            <wscn:ScanTicket>
                <wscn:JobDescription>
                    <wscn:JobName>{{JOB_NAME}}</wscn:JobName>
                    <wscn:JobOriginatingUserName>{{USER_NAME}}</wscn:JobOriginatingUserName>
                    <wscn:JobInformation>{{JOB_INFO}}</wscn:JobInformation>
                </wscn:JobDescription>
                <wscn:DocumentParameters>
                    <wscn:Format>{{FORMAT}}</wscn:Format>
                    <wscn:CompressionQualityFactor>{{QUALITY_FACTOR}}</wscn:CompressionQualityFactor>
                    <wscn:ImagesToTransfer>{{IMG_NUM}}</wscn:ImagesToTransfer>
                    <wscn:InputSource>{{INPUT_SRC}}</wscn:InputSource>
                    <wscn:ContentType>{{CONTENT_TYPE}}</wscn:ContentType>
                    <wscn:InputSize>
                        <wscn:DocumentSizeAutoDetect>{{SIZE_AUTODETECT}}</wscn:DocumentSizeAutoDetect>
                        <wscn:InputMediaSize>
                            <wscn:Width>{{INPUT_W}}</wscn:Width>
                            <wscn:Height>{{INPUT_H}}</wscn:Height>
                        </wscn:InputMediaSize>
                    </wscn:InputSize>
                    <wscn:Exposure>
                        <wscn:AutoExposure>{{AUTO_EXPOSURE}}</wscn:AutoExposure>
                        <wscn:ExposureSettings>
                            <wscn:Contrast>{{CONTRAST}}</wscn:Contrast>
                            <wscn:Brightness>{{BRIGHTNESS}}</wscn:Brightness>
                            <wscn:Sharpness>{{SHARPNESS}}</wscn:Sharpness>
                        </wscn:ExposureSettings>
                    </wscn:Exposure>
                    <wscn:Scaling>
                        <wscn:ScalingWidth>{{SCALING_W}}</wscn:ScalingWidth>
                        <wscn:ScalingHeight>{{SCALING_H}}</wscn:ScalingHeight>
                    </wscn:Scaling>
                    <wscn:Rotation>{{ROTATION}}</wscn:Rotation>
                    <wscn:MediaSides>
                        <wscn:MediaFront>
                            <wscn:ScanRegion>
                                <wscn:ScanRegionXOffset>{{FRONT_X_OFFSET}}</wscn:ScanRegionXOffset>
                                <wscn:ScanRegionYOffset>{{FRONT_Y_OFFSET}}</wscn:ScanRegionYOffset>
                                <wscn:ScanRegionWidth>{{FRONT_SIZE_W}}</wscn:ScanRegionWidth>
                                <wscn:ScanRegionHeight>{{FRONT_SIZE_H}}</wscn:ScanRegionHeight>
                            </wscn:ScanRegion>
                            <wscn:ColorProcessing>{{FRONT_COLOR}}</wscn:ColorProcessing>
                            <wscn:Resolution>
                                <wscn:Width>{{FRONT_RES_W}}</wscn:Width>
                                <wscn:Height>{{FRONT_RES_H}}</wscn:Height>
                            </wscn:Resolution>
                        </wscn:MediaFront>
                        <wscn:MediaBack>
                            <wscn:ScanRegion>
                                <wscn:ScanRegionXOffset>{{BACK_X_OFFSET}}</wscn:ScanRegionXOffset>
                                <wscn:ScanRegionYOffset>{{BACK_Y_OFFSET}}</wscn:ScanRegionYOffset>
                                <wscn:ScanRegionWidth>{{BACK_SIZE_W}}</wscn:ScanRegionWidth>
                                <wscn:ScanRegionHeight>{{BACK_SIZE_H}}</wscn:ScanRegionHeight>
                            </wscn:ScanRegion>
                            <wscn:ColorProcessing>{{BACK_COLOR}}</wscn:ColorProcessing>
                            <wscn:Resolution>
                                <wscn:Width>{{BACK_RES_W}}</wscn:Width>
                                <wscn:Height>{{BACK_RES_H}}</wscn:Height>
                            </wscn:Resolution>
                        </wscn:MediaBack>
                    </wscn:MediaSides>
                </wscn:DocumentParameters>
            </wscn:ScanTicket>
        </wscn:CreateScanJobRequest>
    </soap:Body>
</soap:Envelope>